# Задання виконати в окремому файлі py. Усі пункти завдання відділити одне від одного коментарями. Завдання:

# 1) У вас є змінна величина, тип - int. Напишіть тернарний оператор для змінної new_value за таким правилом: якщо
#     значення менше 100, то new_value дорівнює половині значення, у протилежному випадку - протиположне
#     значенню число

new_value = 101

print(new_value / 2) if new_value < 100 else print(-new_value)

########################################################

# 2) У вас є змінна величина, тип - int. Написати тернарний оператор для змінної new_value за таким правилом: якщо
#     значення менше 100, то new_value дорівнює 1, у протилежному випадку - 0

new_value = 111

print(1) if new_value < 100 else print(0)

########################################################

# 3) У вас є змінна величина, тип - int. Напишіть тернарний оператор для змінного new_value за таким правилом: якщо
#     значення менше 100, то new_value дорівнює True, у протилежному випадку - False

new_value = 11

print(True) if new_value < 100 else print(False)


########################################################

# 4) У вас є змінна my_str, тип - str. Якщо її довджина менше 5, то допишіть в кінці строки її ж.
#     Приклад: було - "qwer", стало - "qwerqwer". Якщо довжина не менше 5, то залишити строку як є.


my_str = ("qwer")

print(my_str + my_str) if len(my_str) < 5 else print(my_str)


########################################################

# 5) У вас є змінна my_str, тип - str. Якщо її довжина менше 5, то допишіть в кінці рядка перевернуту її ж.
#     Приклад: було - "qwer", стало - "qwerrewq". Якщо довжина не менше 5, то залишити строку як є.


my_str = ("qwer")

print(my_str + my_str[::-1]) if len(my_str) < 5 else print(my_str)

